app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("address1", "city", "created_at", "dist_type", "email", "first_name", "last_name", "phone", "state", "updated_at", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
	def create
	  @contact = Contact.new(contact_params)

	  if @contact.save

UPDATE "contacts" SET "address1" = ?, "address2" = ?, "city" = ?, "state" = ?, "updated_at" = ?, "zip" = ? WHERE "contacts"."id" = 7  [["address1", "address 1"], ["address2", "address 2"], ["city", "city"], ["state", "state"], ["updated_at", "2014-06-24 21:50:12.510773"], ["zip", "84104"]]
---
	def update

	  if @contact.update(contact_params)